from src.core.messages.enums import ErrorMessage


ERROR_MESSAGES = {
    ErrorMessage.INVALID_DATE: "❌ Упс, щось не так з датою! Спробуй ще раз у форматі *ДД.ММ.РРРР*. Наприклад: 01.01.2025",
    ErrorMessage.INVALID_AMOUNT: "❌ Упс, сума має бути числом (крапка замість коми). Давай ще раз: 100 або 50.25.",
    ErrorMessage.INVALID_TITLE: "❌ Некоректна назва статті. Спробуйте вказати довшу назву.",
    ErrorMessage.INVALID_DATA: "❌ Щось не так із вашими даними. Перевірте їх та спробуйте ще раз.",
    ErrorMessage.REPORT_ERROR: "😬 Ой-ой, звіт не вдалося створити! Але нічого страшного — спробуй ще раз трохи пізніше. Я вже працюю над виправленням! 💪",
    ErrorMessage.NOT_FOUND: "🤷‍♂️ Хмм... Схоже, тут пусто! Як щодо створити свою першу статтю витрат?",
    ErrorMessage.NO_CHANGES: "🔕 Ви не змінили жодного поля. Витрату не оновлено.",
    ErrorMessage.UPDATE_ERROR: "🔧 Щось пішло не так при оновленні. Не хвилюйся, це тимчасово! Спробуй ще раз за 5 хвилин.",
    ErrorMessage.DELETE_ERROR: "🔧 Щось пішло не так при видаленні. Не хвилюйся, це тимчасово! Спробуй ще раз за 5 хвилин.",
}
